{"file_name": "Break (1).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Is your apps main goal is to support the porduct?. If Is your apps main goal is to support the porduct? is Yes then Consider hit apps. Also, Is your apps main goal is to support the porduct? is connected with Is your app inherently viral? hich is then connected with both Consider Free with IAPs and Does user have valid ID?. Does user have valid ID? is connected with both Consider Free with IAPs and Can you easily explain the apps value in screenshots. Can you easily explain the apps value in screenshots is connected with both Paid service and Is the app itself your core revenue stream which is also connected with Paid service.\"}}"}
{"file_name": "Break (2).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Do you want to do this? which is then connected with Don't do it which is further connected with End. Do you want to do this? is also connected with Will it likely end in disaster?. If Will it likely end in disaster? is No then Do it which is then connected with End and if Will it likely end in disaster? is Yes then Good Movie?. If Good Movie? is No then Don't do it and if Good Movie? is Yes then Do it.\"}}"}
{"file_name": "Break (3).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If New Member eneters User name and Password then Login which is then connected with Authentication which is then connected with D1. If Authentication is existing member then validation and if Authentication is not a member then Print info which is then connected with New Member. Also, If Authentication is ADP Username ADP Password then Validation and if Validation is ADP Username ADP Password then D2.\"}}"}
{"file_name": "Break (4).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Can I Have a Baby? is connected with Are you married?. If Are you married? is Yes then Can you afford his/her expense? and If Are you married? is No then Are you an adult?. If Are you an adult? is No then Adopt a baby and if Are you an adult? is Yes then Do you have a girlfriend/boyfriend?. If Do you have a girlfriend/boyfriend? is No then Can you afford his/her expense? and if Do you have a girlfriend/boyfriend? is Yes then Ready for operation. If Ready for operation is Yes then Can you afford his/her expense? and if Ready for operation is No then Adopt a baby. Also, If Can you afford his/her expense? is Yes then Do you have enough time to take care of him/her? and if Can you afford his/her expense? is No then Adopt a baby. If Do you have enough time to take care of him/her? is No then also Adopt a baby and if Do you have enough time to take care of him/her? is Yes then yes, you can have a baby.\"}}"}
{"file_name": "Break (5).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Customer Consulting and Quotation is connected with Deal? which if Deal? is No then Go home and if Deal? is Yes then Invoice which is then connected with Shipping. Shipping is connected with Custom Clearance which is then connected with Tariff Payment which is further connected with Delivery. Delivery is connected with Payment mode which is then connected with Pay Foreign Exchange?. If Pay Foreign Exchange is No then End and if Pay Foreign Exchange is Yes then Payment which is then connected with End.\"}}"}
{"file_name": "Break (6).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Customer Consulting and Quotation is connected with Deal? which if Deal? is No then Go home and if Deal? is Yes then Invoice which is then connected with Shipping. Shipping is connected with Custom Clearance which is then connected with Payment mode which is further connected with Delivery. Delivery is connected with Service Payment which is then connected with Pay Foreign Exchange?. If Pay Foreign Exchange is No then Stop and if Pay Foreign Exchange is Yes then Payment which is then connected with Stop.\"}}"}
{"file_name": "Break (7).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Exercise is connected with Focus on breathing which is then connected with Repeat which is further connected with Realize distraction. If Realize distraction is NO then Repeat and if Realize distraction is YES then Focus on breathing.\"}}"}
{"file_name": "Break (8).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with homepage which is then connected with have an account. If have an account is No then Sign up which is then connected with Give info and if have an account is yes then Log in. Also, Give info is connected with Submit which is further connected Log in. Log in is connected with Enter e-mail and password which is then connected with Authentication. If Authentication is no then Log in and if Authentication is yes then logged in to the system which is finally connected with end.\"}}"}
{"file_name": "Break (9).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Purchase Process is connected with Fill out details which is then connected with Approved. If Approved is No then Purchase Requisition and if Approved is YES then Credit Card or Cash?. If Credit Card or Cash? is Cash then Is it an independent Contractor?. If Is it an independent Contractor? is YES then Give your details and if Is it an independent Contractor? is NO then Obtain P.O from Controller. If Credit Card or Cash? is Credit Card then Enter card number which is then connected with Invoice CCPR which is further connected with Documents to Controller for Approval. Also, Obtain P.O from Controller is connected with Invoice which if Invoice is To Controller then Documents to Controller for Approval.\"}}"}
{"file_name": "Break (10).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Mail Invoice to Accounts Payable is connected with Review Invoice for Compliance which is then connected with Invoice Meets Requirement?. If Invoice Meets Requirement? is No then Don't accept and if Invoice Meets Requirement? is Yes then Approval?. If Approval? is No then Place in queue and if Approval? is Yes then Invoice Placed in Payment Queue which is then connected with Payment Processed. If Action Taken, Issue Resolved? is No then Place in queue and If Action Taken, Issue Resolved? is Yes then Approval?\"}}"}
{"file_name": "Break (11).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Username acceptable?. If Username acceptable? is No then Close as \"Apolicy\" or \"Invalid\" and If Username acceptable? is Yes then Any blocks?. If Any blocks? is No then Account already exist? which if Account already exist? is Yes then Created recently. If Created recently is No then Close and if Created recently is Yes then Drope request and if Account already exist? is No then SUL taken?. If SUL taken? is Yes then Close Program and if SUL taken? is No then Conflicting accounts?. If Conficting accounts? is Yes then Check another website and if Conficting accounts? is No then Create account.\"}}"}
{"file_name": "Break (12).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Initial which is then connected with Process. If Process is Yes then Data and if Process is No then Data. Both Data are connected with Document.\"}}"}
{"file_name": "Break (13).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Home contract is connected with Deal? which if Deal? is No then Go back and if Deal? is Yes then Paper work. Paper work is connected with Shipping which is then connected with Box check which is further connected with Tariff Payment. Tariff Payment is connected with Delivery which is then connected with Payment mode. Payment mode is connected with Pay Foreign Exchange?. If Pay Foreign Exchange is No then End and if Pay Foreign Exchange is Yes then Payment which is then connected with End.\"}}"}
{"file_name": "Break (14).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Edit Video which is then connected with Short video. If short video is Yes then Click to upload which is then connected with VIP user? If VIP user? is NO then Sign Up and if VIP user? is YES then Login which is then connected with Browse to upload which is finally connected with Finish.\"}}"}
{"file_name": "Break (15).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Pull Customer Invoice from Stack which is then connected with Does Invoice have a Purchase Order#?. If Does Invoice have a Purchase Order#? is No then Contract Purchaser for Information which is then connected with Verify Order and if Does Invoice have a Purchase Order#? is Yes then Verify Order which is then connected with ID match. ID match is connected with Amounts Match?. If Amounts Match? is Yes then Send Invoice to Processing and if Amounts Match? is No then Discrepancy Merit Investigating? which is then connected with File complaint which is further connected with Investigate and Rectify which is finally connected with Amounts Match?\"}}"}
{"file_name": "Break (16).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Step 1 which is then connected with Decision. If Decision is No then Update which is then connected with Step 1 and if Decision is Yes then End.\"}}"}
{"file_name": "Break (17).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If New case is Input then Case retrieval which if Case retrieval is obtain then Similar cases. If Similar cases is Input then Case reuse and if case reuse is Output then Print Result. If Print Result is Evaluate then Case revise which is then connected with Case update. If case update is Store then Case base and if Case base is Retrieve then Case retrieval.\"}}"}
{"file_name": "Break (18).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Door Bell which is then connected with Ready to Get Up?. If Ready to Get Up? is NO then Ignore bell which is then connected with Relay which is further connected with Door Bell and if Ready to Get Up? is YES then Wakeup which is then connected with End.\"}}"}
{"file_name": "Break (19).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Customer Consulting and Quotation is connected with Deal? which if Deal? is No then Stop Deal and if Deal? is Yes then Document Check which is then connected with Shipping. Shipping is connected with Custom Clearance which is then connected with Payment mode which is further connected with Delivery. Delivery is connected with Service Payment which is then connected with Pay Foreign Exchange?. If Pay Foreign Exchange is No then End and if Pay Foreign Exchange is Yes then Payment which is then connected with End.\"}}"}
{"file_name": "Break (20).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with INPUT numbers which is then connected with Perform operation. If Perform operation is Yes then Find Average and if Perform operation is No then INPUT latest which is then connected with total=total+latest which is further connected with Perform operation. Find Average is connected with OUTPUT \"The total of the numbers was\"+total which is then connected with Print result which is finally connected with Stop.\"}}"}
{"file_name": "Break (21).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"You are so hungry is connected with Is Mama at home? which if Is Mama at home? is Yes then ENoy your lunch and if Is Mama at home? is No then Ask your friend which is then connected with Anything you want to eat?. If Anything you want to eat? is Yes then Enjoy your lunch and If Anything you want to eat? is No then Feel lazy to go out?. If Feel lazy to go out? is I want to go out for some fresh air then Go out and if Feel lazy to go out? is Yes, I am very lazy to go out then Order online. Both Order online and Go out are connected with Anything you want to eat?. If Anything you want to eat? is Yes then Enjoy your lunch and if Anything you want to eat? is No then Stay hungry.\"}}"}
{"file_name": "Break (22).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Initialize variables which is then connected with INPUT numbers which is further connected with All numbers been entered?. If All numbers been entered? is Yes then Average=total/numbers which is then connected with Print Output and further connected with Stop. If All numbers been entered? is No then INPUT latest which is then connected with total=total+latest which is finally connected with All numbers been entered?\"}}"}
{"file_name": "Break (23).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Approval Needed?. If Approval Needed? is Yes then Go to manager and if Approval Needed? is No then Finished.\"}}"}
{"file_name": "Break (24).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Identify Problem which is then connected with work on it. Work on it is connected with Note them down in a diagram or table which is then connected with Ask for assistant which is further connected with Need more help?. If Need more help? is No then Ask for assistant and if Need more help? is Yes then Find solutions to the root causes identified which is finally connected with End.\"}}"}
{"file_name": "Break (25).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Submit the registration form which is then connected with Form Complete?. If Form Complete? is No then Submit the registration form and if Form Complete? is Yes then Verify details which is then connected with Accept SUbmission?. If Accept Submission? is Yes then Write Acceptance Letter and if Accept Submission? is No then Return Document which is then connected with End. Also, write Acceptance Letter is connected with Confirmation which is finally connected with End.\"}}"}
{"file_name": "Break (26).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Greet which if Greet is FAILURE then ACCEPT NO COMMANDS otherwise Greet is connected with Enter ID. Enter ID is connected with INPUT DRIVER INFORMATION which is then connected with Verify finger scan. Verify finger scan is connected with SCAN FINGER AGAIN which is then connected with 1st AND 2nd SCAN MATCH?. If 1st AND 2nd SCAN MATCH? is NO then Enter ID and if 1st AND 2nd SCAN MATCH? is YES then Login which is finally connected with STOP.\"}}"}
{"file_name": "Break (27).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Look for address which is then connected with Did you find it?. If Did you find it? is No then Ask someone and If Did you find it? is Yes then Stop looking. If Ask Someone is Yes then Look for address and if Ask someone is No then Stop looking.\"}}"}
{"file_name": "Break (28).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Is she currently working in an important project? is No then Worth it? and if Worth it? is No then Could her leaving interrupt the work flow?. If Could her leaving interrupt the work flow? is Yes then Any other option? and if Could her leaving interrupt the work flow? is No then Let her go. If Any other option? is No then Can the company afford the raise? and if Any other option? is Yes then Let her go!. If Can the company afford the raise? is No then Let her go! and if Can the company afford the raise? is Yes then Keep her.\"}}"}
{"file_name": "Break (29).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Fruits are connected with Input mango, pitaya, durian which is then connected with Prefer mango to pitaya?. Prefer mango to pitaya? is connected with both Prefer pitaya to durian? and Prefer mango to durian?. If Prefer pitaya to durian? is Yes then Go for mango and if Prefer pitaya to durian? is No then also Go for mango. If Prefer mango to durian is Yes then Go for pitaya and if Prefer mango to durian is No then also Go for pitaya. Go for mango, Go for pitaya and Go for pitaya all are connected with End.\"}}"}
{"file_name": "Break (30).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Do you have time to flee? is Yes then Run quickly which is then connected with Yeah! No need to say hi. and if Do you have time to flee? is No then Are you wearing sun glasses?. If Are you wearing sun glasses? is Yes then Don't run which is then connected with Yeah! No need to say hi. and if Are you wearing sun glasses? is No then Could you pretend to get a call?. If Could you pretend to get a call? is Yes then No problem which is then connected with Yeah! No need to say hi. and if Could you pretend to get a call? is No then Finish.\"}}"}
{"file_name": "Break (31).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Initialize which is then connected with Decision. If Decision is No then Process which is then connected with Delay which is further connected with Initialize and if Decision is Yes then Print result which is finally connected with End.\"}}"}
{"file_name": "Break (32).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Door bell which is then connected with Ready to face the world? which if Ready to face the world? is Yes then Get Up which is then connected with End and if Ready to face the world? is No then Ignore which is then connected with Delay inevitable for 5 minutes which is finally connected with Door bell.\"}}"}
{"file_name": "Break (33).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input Total Score which is then connected with If total score>800. If total score>800 is No then Not good college and if total score>800 is Yes then Good college. Not good college and Good college both are connected with End.\"}}"}
{"file_name": "Break (34).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Interested in watching movie? which if Interested in watching movie? is no then Well, go read a book then. and if Interested in watching movie? is yes then Know the story?. If Know the story? is no then Think about what part of the process you need to see and if Know the story? is yes then Let's start.\"}}"}
{"file_name": "Break (35).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with COMPUTE LOCAL ADMIN GROUP NAME which is then connected with ADD OR REMOVE?. If ADD OR REMOVE? is ADD then Update which is then connected with ADD USERS TO GROUP which is further connected with END and if ADD OR REMOVE? is REMOVE then Personalize which is then connected with DISPLAY CURRENT MEMBERS which is further connected with Check and finally Check is connected with END.\"}}"}
{"file_name": "Break (36).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Circuit is connected with Process which is then connected with CONTROL CIRCUIT which is further connected with VALVES. If Condenser is Air then SERVICE UNIT F,R,L,P which if SERVICE UNIT F,R,L,P is Lubricated Air then VALVES which is then connected with CYLINDER.\"}}"}
{"file_name": "Break (37).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Work. If Work is Yes then add and if Work is No then Process which is further connected with update. Both update and add are connected with End.\"}}"}
{"file_name": "Break (38).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Enter which is then connected with Home page. Home page is connected with Enter Email ID and Password which is then connected with Is Email ID and Password Correct?. If Is Email ID and Password Correct? is No then Log in error which is then connected with Enter Email ID and Password and if Is Email ID and Password Correct? is Yes then Display Account which is finally connected with Stop.\"}}"}
{"file_name": "Break (39).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Initial is connected with Case 1 which if Case 1 is Yes then Statement 1 which is then connected with End and if Case 2 is No then Case 2. If Case 2 is Yes then Statement 2 which is then connected with End and if Case 2 is No then Case N. If Case N is Yes then Statement N which is then connected with End and if Case N is NO then Default statement which is finally connected with End.\"}}"}
{"file_name": "Break (40).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Program is connected with Input image which is then connected with Description. Description is connected with Segmentation which is then connected with Obstacle/Non-obstacle decision.\"}}"}
{"file_name": "Break (41).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Take Input which is then connected with If Number%2==0. If Number%2==0 is False then Print: \"Number is odd\" and if Number%2==0 is True then Print result which is finally connected with End.\"}}"}
{"file_name": "Break (42).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Arrival is Periodically release then update and if Incoming is Can be batched to form then Update.\"}}"}
{"file_name": "Break (43).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Get n which is then connected with n%2==0. If n%2==0 is Yes then Even and if n%2==0 is No then Odd. Both Even and Odd are connected with Stop.\"}}"}
{"file_name": "Break (44).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start Loop is connected with Initialize which if Initialize is False then End Loop and if Initialize is True then Process which is then connected with Increment or Decrement which is finally connected with Initialize.\"}}"}
{"file_name": "Break (45).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Input which is then connected with Process. If Process is Yes then Add which is then connected with End and if Process is No then Subtract which is then connected with End.\"}}"}
{"file_name": "Break (46).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Connection is connected with Users enters login name and password which is then connected with Correct login and password?. If Correct login and password? is No then Alert which is then connected with Users enters login name and password and if Correct login and password? is Yes then User successfully logs in. User successfully logs in is connected with Display which is then connected with connection and finally connected with User logs into the system.\"}}"}
{"file_name": "Break (47).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Do You Understand Flowcharts? which if Do You Understand Flowcharts? is Yes then Great! which is then connected with Explain everyone and if Do You Understand Flowcharts? is No then Would You Like to Start With the Basics?. If Would You Like to Start With the Basics? is YES then Read each detail and if Would You Like to Start With the Basics? is NO then Further Reading About Flowcharts.\"}}"}
{"file_name": "Break (48).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Website is connected with Login Page which is then connected with Is the login correct? which if Is the login correct? is Incorrect Credentials then Login Page otherwise Is the login correct? is connected with Enter.\"}}"}
{"file_name": "Break (49).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Connection is connected with New Employee Fills in Paperwork which is then connected with decision. If decision is Document Approved then Documents Sent to Management for Approval which is then connected with Allocate new space which is finally connected with connection and if decision is Document Fix Request then Update which is then connected with decision.\"}}"}
{"file_name": "Break (50).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"A team member suggests a project which is then connected with Study about project which is then connected with Participants decide if it's a good idea which if Participants decide if it's a good idea is No then Team rejects idea and if Participants decide if it's a good idea is Yes then Explain more and if Participants decide if it's a good idea is not enough info then Team member conducts more research which is then connected with Study about project. Also Team rejects idea is connected with End. Explain more is connected with Team member writes proposal is connected with Team reviews proposal which is further connected with Proposal OK?. If Proposal OK? is No then Revise which is then connected with Team reviews proposal and if Proposal OK? is Yes then Team sends proposal to final decision-maker which is finally connected with End.\"}}"}
{"file_name": "Break (51).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Select the area to check which is then connected with Generating inventory list which is further connected with The warehouse manager arrived at the location. The warehouse manager arrived at the location is connected with Read the goods which is then connected with Count all which is further connected with Keep inventory. If Keep inventory is Y then Select the area to check and if Keep inventory is N then Summary inventory information which is further connected with Data base. Data base is connected with Check everything which is finally connected with End.\"}}"}
{"file_name": "Break (52).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Inferred OD is connected with Get array of paths from O to D which is then connected with Find the best route which is further connected with Trip exists?. If Trip exists? is No then Arrival Time Inference Fails and if Trip exists? is Yes then Find arrival time at segment alighting location which is then connected with Arrival Time?. If Arrival Time? is No then Next trip which is then connected with Trip exists? and if Arrival Time? is Yes then Final segment which if Final segment is No then Check another one which is then connected with Find the best route and if Final segment is Yes then alighting time + egress time = arrival time.\"}}"}
{"file_name": "Break (53).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Homepage which is then connected with have an account. If have an account is No then Sign up which is then connected with Fill out the information which is further connected with Submit and if have an account is yes then Login. Also, Submit is connected with Log in which is then connected with Enter details. Enter details is connected with e-mail and password valid which if e-mail and password valid is no then Log in and if e-mail and password valid is yes then logged in to the system which is finally connected with end.\"}}"}
{"file_name": "Break (54).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Enter to the website which is then connected with have an account which if have an account is No then Sign up which is then connected with Fill details which is further connected with Submit and if have an account is yes then Login. Also, Submit is connected with Log in which is then connected with Enter e-mail and password. Enter e-mail and password is connected with e-mail and password valid which if e-mail and password valid is no then Log in and if e-mail and password valid is yes then profile which is finally connected with end.\"}}"}
{"file_name": "Break (55).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"CPU is connected with Is the process controlled? which if Is the process controlled? is Yes then Does a solution already exist? and if Is the process controlled? is No then Develop a controlled process which is then connected with Does a solution already exist?. If Does a solution already exist? is No then Any problem? and if Does a solution already exist? is Yes then Fix it now!. If Any problem? is Yes then Is it designed related? and also if Any problem? is Yes then Figure out simplest solution. If Is it design related? is No then Is the problem complex? and if Is it design related? is Yes then Update. If Is the problem complex? is Yes then 6-Sigma or other and if Is the problem complex? is No then Is the problem related to the 8 Wastes? which if Is the problem related to the 8 Wastes? is Yes then Stop.\"}}"}
{"file_name": "Break (56).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Confirmation is connected with Briefing to all staff by Management which is then connected with Profile analysis. Profile analysis is connected with Selection which is then connected with Review which is further connected with Job Questionaire & Employee Interviewing for Data Collection. Job Questionaire & Employee Interviewing for Data Collection is connected with Consent sign which is then connected withDrafting JD & Discuss with Dept. Head which is further connected with Manager review. Manager review is connected with JD Confirm? which if JD Confirm? is No then Review & Amend which is further connected with Manager review and if JD Confirm? is YES then TRaining. If Training is New Staff then Handled by HR Dept. and If Training is Existing Staff then Handled by Dept. Head. Also, Handled by HR Dept., Training, and Handled by Dept. Head all are connected with Finish.\"}}"}
{"file_name": "Connect (1).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Documentation Work which is then connected with Print cycle count sheets which is further connected with Perform physical count of stock. Perform physical count of stock is connected with Enter physical counts which is then connected with Report differences which is further connected with Recount inventory?. If Recount inventory? is No then Post inventory documents which is then connected with End and if Recount inventory? is Yes then Display documents which is then connected with Perform physical count of stock which is finally connected with Report differences.\"}}"}
{"file_name": "Connect (2).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Identify the Problem which is then connected with Establish a Theory which is then connected with New Theory?. If New Theory? is No then Find new idea and if New Theory? is Yes then Test the Theory which is then connected with Theory Confirmed?. If Theory Confirmed? Is No then Establish a Theory and if Thory Confirmed? is Yes then Establish a Plan of Action.\"}}"}
{"file_name": "Connect (3).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Username which is then connected with Password which is further connected with Username && Password corresponds to the ones in database?. If Username && Password corresponds to the ones in database? is Yes then Enter ID and password and if Username && Password corresponds to the ones in database? is No then \"Invalid credentials\" which is then connected with Username. Enter ID and password is connected with Is User_ID blocked? which if Is User_ID blocked? is Yes then \"403 Forbidden\" and if Is User_ID blocked? is No then Login successfully. \"403 Forbidden\" is connected with Username and Login successfully is connected with End.\"}}"}
{"file_name": "Connect (4).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read Value which is then connected with Temp<32? which if Temp<32? is Yes then Print Cold and if Temp<32? is No then Print Not Cold. Print Cold and Print Not Cold both are connected with End.\"}}"}
{"file_name": "Connect (5).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Switch On lights which is then connected with Turn the LED connected to QO off. Turn the LED connected to QO off is connected with Check if the LDR connected to A is in darkness. If Check if the LDR connected to A is in darkness is N then Switch Off lights then again Check if the LDR connected to A is in darkness and if Check if the LDR connected to A is in darkness is Y then Turn the LED connected to QO on which is then connected with Check if the LDR connected to A is in darkness.\"}}"}
{"file_name": "Connect (6).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Problem is connected with Find Solution which is then connected with New Solution. If New Solution is No then Escalate When Out of Ideas for New Theories and If New Solution is Yes then Test the Theory which is then connected with Theory Confirmed?. If Theory Confirmed? is No then Find Solution and if Theory Confirmed? is Yes then Establish a Plan of Action.\"}}"}
{"file_name": "Connect (7).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read AI0, AI1 and AI2  which is then connected with Convert values to standard which is further connected with Current Value>Safety Thresholds. If Current Value>Safety Thresholds is Yes then Display warning with visual indicator and if Current Value>Safety Thresholds is No then Print Message. Print Output is connected with Log the data in txt files for future analysis which is then connected with both Read AI0, AI1 and AI2 and End.\"}}"}
{"file_name": "Connect (8).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"QA is connected with QA Manual, Information & advice and Unit. Unit is then connected with Center for Healthcare, Delivery of Care, Invoice and GENERAL. Centre for Healthcare is connected with Standard Operating Procedures and Protocols and Trial Paperwork. Delivery of Care and Invoice both are connected with Best practice guidelines. GENERAL is connected with Research Governance, Induction, and Staff Handbook. Research Governance is connected with Good Clinical Practice and Protecting Information Policy. Also, Staff Handbook is connected with Protecting Information Policy.\"}}"}
{"file_name": "Connect (9).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Bad environment is connected with Work Process A General Requirements which is then connected with Has the area been monitored for noise levels?. Has the area been monitored for noise levels? is No then Environment Monitor and if Has the area been monitored for noise levels? is Yes then Is the exposure considered \"nuisance\" level noise?. Also, Environment Monitor is connected with Is the exposure considered \"nuisance\" level noise?. If Is the exposure considered \"nuisance\" level noise? is Yes then Work Process C Controlling Nuisance Noise and if Is the exposure considered \"nuisance\" level noise? is No then Is the exposure considered \"hazardous\"?. Also, Work Process C Controlling Nuisance Noise is connected with Is the exposured considered \"hazardous\"?. If Is the exposured considered \"hazardous\"? is Yes then Work Process D Controlling Hazardous Noise and if Is the exposured considered \"hazardous\"? is No then Need to be entrolled in the Hearing Conservation Program?. Also, Work Process D Controlling Hazardous Noise is connected with Need to be entrolled in the Hearing Conservation Program?. If Need to be enrolled in the Hearing Conservation Program? is Yes then Testing Phase and if Need to be enrolled in the Hearing Conservation Program? is No then Proceed with work.\"}}"}
{"file_name": "Connect (10).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Memory is connected with Tx: Epely maneuver which is then connected with Positional test. If Positional test is Resolution of the PC-BPPV then End of Study and If Positional test is Treatment failure then Random allocation. Random allocation is then connected with both Malware Test and Tx: Semont maneuver. Also, Malware Test and Tx: Semont maneuver both are connected with Positional test which is finally connected with End of study.\"}}"}
{"file_name": "Connect (11).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Pre-processing using is connected with Feature Extraction which is then connected with Parameter Optimization which is further connected with Classification. Classification is then connected with Pure speech, Music, Environmental sound, and Amplifier.\"}}"}
{"file_name": "Connect (12).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Lwave home is then connected with Check time which is then connected with Before 7 am?. If Before 7 am? is NO then Take bus and if Before 7 am? is YES then Take Car. Also, both Take bus and Take Car are connected with Reach school.\"}}"}
{"file_name": "Connect (13).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Planning is connected with SUn-dried & decorticated which is then connected with Leave it. Leave it is connected with Extraction (Mechanical/Solvent/intermittent which is then connected with Gathering which is further connected with Sedimentation/boiling with water/filteration. Sedimentation/boiling with water/filteration is connected with STEP-3 Processing of oil which is then connected with Dilution with hydrocarbons, Seed, Micro-emulsification, and Transesterification. Dilution with hydrocarbons is connected with Blended fuel. seed is connected with Liquid fractions. Micro-emulsification is connected with Micro-emulsification. Transesterification is connected with Waste.\"}}"}
{"file_name": "Connect (14).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Sum=0 N=50 which is then connected with Update which is further connected with Sum=Sum+N. Sum=SUm+N is connected with N=99? which if N=99? is No then Update and if N=99? is YES then PRINT SUM which is finally connected with END.\"}}"}
{"file_name": "Connect (15).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Image DataBase is connected with both Train sample and Test sample. Train sample is connected with SVM CLassifier which is then connected with Model. Also, Test Sample is connected with Model which is finally connected with Result.\"}}"}
{"file_name": "Connect (16).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Initiate agent is connected with Evaluate the fitness for each agent which is then connected with Update values. Update values is connected with Calculate M and a for each agent which is then connected with Update velocity and position which is further connected with Meeting end of criterion?. If Meeting end of criterion? is No then Evaluate the fitness for each agent and if Meeting end of criterion? is Yes then Finish.\"}}"}
{"file_name": "Connect (17).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Login Profile is connected with Still Logged in?. If Still Logged in? is No then Session time out which is then connected with Login Again and if Still Logged in? is Yes then Go On which is then connected with Still Logged in?. Login Again is connected with Logged in? which if Logged in? is No then Pause Counting and if Logged in? is Yes then Go On.\"}}"}
{"file_name": "Connect (18).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Recruitment Requisition is connected with Talk with HR which is then connected with Advertise for the Job which is further connected with Recieve application for the Job. Recieve application for the Job is connected with Categorise application which is then connected with both Good candidate and Unsuitable for the Job. Good candidate is connected with Assess against criteria and if Assess against criteria is Yes then Interview candidate and if Assess against criteria is No then Send Thank you letter email. Also, Unsuitable for the Job is connected with Send Thank you letter email. Interview candidates is connected with Next round which if Next round is No then Send Thank you letter email and if Next round is Yes then 2nd Interview which is further connected with Assess against criteria. If Assess against criteria is No then Send Thank you letter email and if Assess against criteria is Yes then Job offer.\"}}"}
{"file_name": "Connect (19).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Structural ecodesign of a composite wind turbine blade is connected with Initial database which is then connected with Initial eco-coefficients which is further connected with Software tool for structural analysis. Software tool for structural analysis is connected with Assessment which if Assessment is Good then Display result and if Assessment is Bad then Update result which is then connected with New database. New database is connected with New eco-coefficients which is then connected with Optimisation which is finally connected with Software tool for structural analysis.\"}}"}
{"file_name": "Connect (20).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Problem is Y then What is it? which is further connected with Do I know the solution? and if Problem is N then I don't need help. Also, If Do I know the solution? is N then I need help and if Do I know the solution? is Y then Think of solution. If Think of solution is N then I need help and if THink of solution is Y then Try my solution which is further connected with Did it work?. If Did it work? is N then I need help and if Did it work? is Y then I don't need help.\"}}"}
{"file_name": "Connect (21).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Read Inputs which is then connected with Read command from Bluetooth Unit which is further connected with Run sensors. Run sensors is connected with Read sensor values which is then connected with Send read sensor values To bluetooth unit which is finally connected with Read command from Bluetooth Unit.\"}}"}
{"file_name": "Connect (22).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Initialization is connected with Senior pathologist sample qualification which is then connected with Sample check. Sample check is connected with cartidge assay is then connected with Invalid result, Infected, and No Infection. Invalid result and Infected both are connected with STOP and No Infection is connected with Go Home. Also, STOP and Go Home both are connected with Results.\"}}"}
{"file_name": "Connect (23).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"reference is connected with Noice romovel which is then connected with Subsampling, Time alignment, and Similarities. Time alignment is connected with Similarities which is further connected with Analysis of feature distribution. Subsampling is connected with Information Extraction which is then connected with Global temporal degradation which is further connected with Perceptually aggregation and Analysis of feature distribution is also connected with Perceptually motivated aggregation which is finally connected with Result.\"}}"}
{"file_name": "Connect (24).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Is target sector < max sector? which if Is target sector < max sector? is Yes then Increment Sector which is further connected with End and if Is target sector < max sector? is No then Target Sector=0 which is then connected with Want to update?. If Want to update? is Yes then Increment head  which is then connected with End and if Want to update? is No then Target head=0 which is then connected with Increment which is finally connected with End.\"}}"}
{"file_name": "Connect (25).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"User is connected with Login? which if Login is No then Activate Events and if Login? is Yes then Manage friends and Check message.Then Check message and Activate Events are connected with Manage Events which is finally connected with Finish.\"}}"}
{"file_name": "Connect (26).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Round 1 T=1 which is then connected with Draw lots to select witness nodes which is further connected with Binarize block. Binarize block is connected with Packing block which is then connected with Block verification. If Verification failed then Timeout verification which if Timeout verification is Timeout then Next round draw which is further connected with Draw lots to select witness nodes. Also Block verification is connected with Authentication which is further connected with Binarize block. And, If Block verification is Success then Finish.\"}}"}
{"file_name": "Connect (27).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Login which is then connected with Verified?. If Verified is No then Login and if Verified is Yes then Dashboard which is then connected with Click on the report incident link which is further connected with Fill the form. Fill the form is connected with Validation Module which is then connected with Need?. If Need? is No then Update form which is then connected with Submit which is further connected with Validation Module. If Need? is Yes then View comments on the post which is finally connected with Stop.\"}}"}
{"file_name": "Connect (28).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Candidate is connected with Are two candidate left?. If Are two candidate left? is no then Eliminate last place candidate which is connected with Recount all ballots which is further connected with Are two candidate left?. And, If Are two candidate left? is yes then Finish.\"}}"}
{"file_name": "Connect (29).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with identity authentication which is then connected with identity verification. If identity verification is N then Try Again which is further connected with identity verification and if identity verification is Y then Profile. If Profile is N then User and if Profile is Y then identity management.\"}}"}
{"file_name": "Connect (30).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Pre-configuration which is then connected with Input which is further connected with Input Signal Analysis. Input Signal Analysis is connected with Input Signal Analysis Finished? which if Input Signal Analysis Finished? is YES then Output Signal Analysis which is then connected with Output Signal Analysis Finished?. If Output Signal Analysis Finished? is No then Update which is further connected with Input and if Output Signal Analysis Finished? is YES then Back to work which is also connected with Input.\"}}"}
{"file_name": "Connect (31).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read Temp which is then connected with Temp<32? which if Temp<32? is Yes then Go out and if Temp<32 is No then Don't go out. Then Go out and Don't go out both are connected with End.\"}}"}
{"file_name": "Connect (32).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Count voters' First Choices is connected with Any one left? If Any one left? is no then Eliminate last place candidate which is then connected with Recount all ballots which is further connected with Any one left?. If Any one left? is yes then Search them.\"}}"}
{"file_name": "Connect (33).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Initialize weights and biases With random values which is then connected with Perform oprations. Perform operations is connected with Calculate Error which is then connected with Error<Error. If Error<Error is Yes then End and if Error<Error is No then Epoch>Epoch. If Epoch>Epoch is Yes then End and if Epoch>Epoch is No then Update weights and biases which is then connected with Epoch=epoch+1 which is finally connected with Perform operations.\"}}"}
{"file_name": "Connect (34).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Hard work which is then connected with Franchise and New Strategy which is further connected with Success. If Success is No then New Strategy and if Success is Yes then Order more which is then connected with Sold. If Sold is No then New Strategy and if Sold is Yes then Expandable. If Expandable is Yes then open more store which is then connected with Success and if Expandable is No then End.\"}}"}
{"file_name": "Connect (35).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Power on which is then connected with Coffee selected. If Coffee selected is Latte then Add frothed milk and if Coffee selected is Espresso then Add sugar and if Coffee selected is Mocha then Add Chocolate powder which is then connected with Add frothed milk. Add frothed milk is then connected with Add sugar which is then connected with Power pressed. Power pressed is then connected with Power off which is finally connected with End.\"}}"}
{"file_name": "Connect (36).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Randomly generating a group of parameters of SVM model is connected with Calculate all the values which is then connected with Finding out the optimal fitness value. Finding out the optimal fitness value is connected with Are optimazation criteria met?. If Are optimazation criteria met? is No then Generating new group by evolutionary operation which is further connected with Calculate all the values and if Are optimazation criteria met? is Yes then Finish.\"}}"}
{"file_name": "Connect (37).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Connection is connected with Take all values which is then connected with Input Hours Per Week which is further connected with Hourly Pay x Hours Per Week. Hourly Pay x Hours Per Week is connected with weeklypay>400 which if weeklypay>400 is true then Output can afford to live along and if weeklypay>400 is false then Poor condition. Output can afford to live along and Poor condition both are connected with End.\"}}"}
{"file_name": "Connect (38).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input Image is connected with Feature extraction which is then connected with SVM Classifier which is then connected with Normal and Abnormal. Database is connected with SVM Classifier.\"}}"}
{"file_name": "Connect (39).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Data Acquisition is connected with Preprocessing which is then connected with Signal sampling which is further connected with Labelling R-peaks with their Location. Labelling R-peaks with their Location is connected with Signal which is then connected with Geometry Analysis, Frequency-domain Analysis, and Time domain Analysis. Also, Geometry Analysis, Frequency-domain Analysis, and Time-domain Analysis all are connected with HRV Evaluation.\"}}"}
{"file_name": "Connect (40).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"RF Front End is connected with Amplifier which is then connected with Acquisition which is further connected with Channel 1 Tracking, Channel 2 Tracking, and Channel n Tracking and Channel 2 Tracking is connected with End. Also, Noise is connected with Amplifier.\"}}"}
{"file_name": "Connect (41).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input Data which is then connected with Process which is further connected with Looking for Gain. Looking for Gain is connected with Determine the Highest Gain which is then connected with Update which is further connected with Finished. If Finished is Yes then End and if Finished is No then Looking for Gain.\"}}"}
{"file_name": "Connect (42).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Solar Panel is connected with Power Regulator which is then connectedw ith Main Switch which is further connected with Voltage Divider. Power Regulator is connected with both DC-to-DC Converter and Stop. Main switch is connected with DC-to-DC Converter and Voltage Divider is connected with Fans. DC-to-DC Converter is connected with DC-to-AC Inverter. Also, DC-to-AC Inverter and Fans are connected with Stop.\"}}"}
{"file_name": "Connect (43).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Construction is connected with Acceptance of transformer is connected with both Insulating oil treatment and Accessories Installation which is then connected with Vacuum. Insulating oil treatment and Vacuum both are connected with Sample Test which is then connected with Hot oil circulation. Hot oil circulation is connected with Check impurities which is then connected with Standing which is finally connected with Completed.\"}}"}
{"file_name": "Connect (44).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Source is connected with Hadamard Code which is then connected with STBC ENcoder. STBC Encoder is then connected with OFDM mod and mod.\"}}"}
{"file_name": "Connect (45).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with READ which is then connected with M=1 F=1 which is further connected with F=F*M. F=F*M is connected with M=N? which if M=N? is NO then M=M+1 which is further connected with F=F*M and if M=N? is YES then PRINT which is further connected with END.\"}}"}
{"file_name": "Connect (46).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with This is an example of flow chart symbols. which is then connected with num1 and num2 which is further connected with num1>num2. If num1>num2 is True then Update which is then connected with connection and if num1>num2 is False then num1++ num2-- which is directly connected with Display: num1, num2. Also, connection is connected with End which is finally connected with End.\"}}"}
{"file_name": "Connect (47).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with guess number which is then connected with if<=10 which if<=10 is true then small number and if<=10 is false then if>10 and <=80. Also, if>10 and <=80 is true then medium number and if>10 and <=80 is false then large number. Small number, medium number, and large number all are connected with end.\"}}"}
{"file_name": "Connect (48).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Generate new colony which is then connected with Colony performance evaluation which is further connected with Binary Search. Binary Search is connected with Crowding distance sorting which is then connected with Update colony which is further connected with Need more values?. If Need more values? is No then Colony performance evaluation and if Need more values? is Yes then End.\"}}"}
{"file_name": "Connect (49).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Power Supply is connected with both Bulb and TV. Also, Bulb and TV both are connected with Processor which is then connected with Hard Drive.\"}}"}
{"file_name": "Connect (50).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Log In is connected with Logged in which if Logged in is No then OpenID and if Logged in is Yes then Home. Also, OpenID is connected with Home.\"}}"}
{"file_name": "Connect (51).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with iCounter=1 which is then connected with Output iCounter which is further connected with Increment. Increment is connected with iCounter<=0 which if iCounter<=10 is True then Output iCounter and if iCounter<=10 is False then End.\"}}"}
{"file_name": "Connect (52).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Raw Image is connected with De-noising which is then connected with Image Thresholding which is further connected with Isolated pixels removal. Isolated pixels removal is connected with Inverse Image which is then connected with Mean Average which is further connected with Operator. Operator is connected with Interpolation Image, Correlation Image, and Sampling. Also, Correlation Image is connected with Edge Detection.\"}}"}
{"file_name": "Connect (53).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Collect rice sheath blight images is connected with Image preprocessing which is then connected with smoothing, Histogram equalization, and segmentation. Also, smoothing and segmentation are connected with Feature extraction which is further connected with both feature extraction and Texture extraction.\"}}"}
{"file_name": "Connect (54).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Database searches n=408, Conference abstracts n=16, and clinicaltrials.gov n=68 are connected with Records identified n=492 which is then connected with both Records screened and Duplicates removed. Records screened is then connected with both Records independently screened by two reviewers and Clearly irrelevant records removed. Then, Records independently screened by two reviewers is connected with Full-text articles retrieved and Irrelevant records removed. Full-text articles retrieved is then connected with both Stop the process and Update.\"}}"}
{"file_name": "Connect (55).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with count=1 which is then connected with count<=3. If count<=3 is No then STOP and if count<=3 is Yes then INPUT which is then connected with p*n*r/100 which is further connected with PRINT. PRINT is connected with count=count+1 which is then connected with count<=3.\"}}"}
{"file_name": "Connect (56).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Does the User has an account? which if Does the user has an account? is No then Go to website which is then connected with \"Open an account\" page open and if Does the user has an account? is Yes then User enter email which is then connected with User enter password which is further connected with User clicks on the login button. User clicks on the login button is connected with Are the email and password is correct? which if Are the email and password is correct? is No then Close and if Are the email and password is correct? is Yes then Error message appears.\"}}"}
{"file_name": "Connect (57).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Start is Disapproved then Keyword reected and also Start is connected with both Marketer gathers outreach list and Writer creates article draft (With image ideas). Writer creates article draft (With image ideas) is then coonected with Feedback and if feedback is Edits needed then again Writer creates article draft (With image ideas) and also Feedback is connected with Designer creates graphics which is further connected with Marketer optimizes article & publishes it which is finally connectedw ith Finish.\"}}"}
{"file_name": "Connect (58).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Run Main FLASH which is then connectedw ith Is the Main FLASH Application OK?. If Is the Main FLASH Application OK? is No then Initialize IAP Interface and if Is the Main FLASH Application OK? is Yes then Main Application which is also then connected with Initialize IAP Interface. Initialize IAP Interface is connected with Is IAP Request Received? which if Is IAP Request Received? is No then again Is IAP Request Received? and if Is IAP Request Received? is Yes then Reprogram Main Application which is finally connected with RESET.\"}}"}
{"file_name": "Connect (59).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Probelm which is then connected with Develop an Algorithm which is further connected with Think creativity. Think creativity is connected with Create an Action Plan which is then connected with Discuss which is further connected with Test the Solution. Test the Solution is connected with Is the Problem Solved? which if Is the Problem Solved? is No then again Think creativity and if Is the Problem Solved? is Yes then End.\"}}"}
{"file_name": "Connect (60).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Set up the training pattern which is then connected with Set up the structure which is further connected with Use the training pattern. Use the Training pattern is connected with Training finished? which if Training finished? is no then Use the training pattern and if Training finished? is yes then Save the connection weights which is then connected with Power quality Analysis which is finally connected with End.\"}}"}
{"file_name": "Connect (61).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with READ which is then connected with M=1 F=1 which is further connected with F=F*M. F=F*M is connected with M=N? which if M=N? is NO then M=M+1 which is further connected with F=F*M and if M=N? is YES then PRINT which is finally connected with END.\"}}"}
{"file_name": "Connect (62).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Check Weather which is then connected with Is it raining?. If Is it raining is NO then Leave umbrella at home and if Is it raining is YES then Take an umbrella. Leave umbrella at home and Take an umbrella both are connected with END.\"}}"}
{"file_name": "Connect (63).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Plaintext is connected with Ciphertext which is then connected with Plaintext. Also, ID is connected with Ciphertext and Pass is connected with Plaintext.\"}}"}
{"file_name": "Connect (64).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Screening from database is connected with both Cluster random sampling and Exclusion. Then, Cluster random sampling is connected with 128 institutions and No participation. Then, 128 institutions is connected with Enrollment 128 institutions and Data missing, Unconfirmed diagnosis.\"}}"}
{"file_name": "Normal (1).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Promotion is connected with Manager Post which is then connected with both Send Letter via Internet and Auditor Schedules Opening Conference. Auditor Schedules Opening Conference is then connected with both Send Opening Conference Confirmation (via Email) and Risk Assessment by Auditors which is further connected with Documentation. Documentation is connected with Opening Conference which is further connected with both Risk Assessment by Auditors and Manager Reviews Planning. Manager Reviews Planning is connected with Fieldwork Performance which is then connected with Audit Observation Form which is further connected with Finalization which is finally connected with Fieldwork Performance.\"}}"}
{"file_name": "Normal (2).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Hans Albert Einstein is Son of Mileva Mariac and Albert Einstein. Mileva Maric is wife of Albert Einstein and Albert Einstein is son of Hermann Einstein. Also, Albert Einstein was born in German Empire.\"}}"}
{"file_name": "Normal (3).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Hans Albert Einstein is Son of Albert Einstein. Mileva Maric is wife of Albert Einstein and Albert Einstein is son of Hermann Einstein. Also, Albert Einstein was born in German Empire.\"}}"}
{"file_name": "Normal (4).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Piotr Hallmann was born on 25 August 1987 in Gdynia, Poland. He is 175.26m tall and weighs 70.308kg.\"}}"}
{"file_name": "Normal (5).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Artificial Intelligence is connected with Machine Learning which is further connected with Deep Learning.\"}}"}
{"file_name": "Normal (6).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected to K is equal to 0 which is then connected with LOOP and further connected with YES OR NO?. Also, YES OR NO is connected with both calculate K as K+1 and PRINT K. Calculate K as K+1 is then connected to LOOP and PRINT K is connected to STOP.\"}}"}
{"file_name": "Normal (7).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Customer order TV Sofa then after order confirmation it ships.\"}}"}
{"file_name": "Normal (8).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"John likes Mango and Allen Dislikes Mango.\"}}"}
{"file_name": "Normal (9).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read A, which is then connected with Read B. Read B is connected with Calculate sum as A + B, which is then connected with Print Sum which is finally connected with the End.\"}}"}
{"file_name": "Normal (10).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with K is equal to 0 which is then connected with Calculate K as K+1 which is further connected with PRINT K which is finally connected with STOP.\"}}"}
{"file_name": "Normal (11).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Input Variable: K which is then connected with If K%2==0 which if K%2==0 is False then Print: K is odd and if K%2==0 is True then Print: K is Even which is finally connected with STOP.\"}}"}
{"file_name": "Normal (12).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with K is equal to 0 which is then connected with LOOP. LOOP is connected with YES OR NO?. If YES OR NO, is yes then calculate K as K+1 which is then connected to LOOP. If YES OR NO is No then PRINT K which is finally connected with STOP.\"}}"}
{"file_name": "Normal (13).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Lamp doesn't work is connected with Lamp plugged in? which if Lamp plugged in? is No then Plug in lamp and if Lamp plugged in? is Yes then Lamp plugged in?. If Lamp plugged in? is Yes then Replace bulb and if Lamp plugged in? is No then PRINT K.\"}}"}
{"file_name": "Normal (14).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"BEGIN is connected with Check Parameter which is then connected with CLICK CHOLERA ETEC OR BACKnwhich is then connected with Take rest, THE SCREEN GOES BACK TO THE HOME, and THE APP PLAYS AUDIO FOR ETEC. Take rest is then connected with CLICK CHOLERA BUTTON AGAIN. THE SCREEN GOES BACK TO THE HOME is connected with END. THE APP PLAYS AUDIO FOR ETEC is connected with CLICK ETEC. CLICK CHOLERA BUTTON AGAIN is connected with THE CHOLERA AUDIO STOPS and CLICK ETEC is connected with THE ETEC AUDIO STOPS. Also, THE CHOLERA AUDIO STOPS and THE ETEC AUDIO STOPS both are connected with END.\"}}"}
{"file_name": "Normal (15).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input which is then connected with If (angka%2==1) which if (angka%2==1) is False then Non prime and if (angka%2==1) is True then Prime Number. Also, Prime Number and Non prime both are connected with Finish.\"}}"}
{"file_name": "Normal (16).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"1 is connected with Costumer Order which is then connected with Sales Order which is further connected with Documentation. If Documentation is No then again Sales Order and if Documentation is YES then Prepare DO which is further connected with Shipment. Shipment is connected with Goods Delivered which is finally connected with 2.\"}}"}
{"file_name": "Normal (17).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Preparation is connected with Documentation which is then connected with Process which is further connected with Authentication. Authentication is connected with Finalize whhich is finally connected with Stop.\"}}"}
{"file_name": "Normal (18).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Is it necessary? which if Is it necessary? is NO then Don't do it! and if Is it necessary? is YES then Will it fail?. If Will it fail? is NO then Do it! and if Will it fail? is YES then Knowledge. If Knowledge is NO then Don't do it and if Knowledge is YES then Do it!.\"}}"}
{"file_name": "Normal (19).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Mixed Data is connected with Classifier which is then connected with Class 1, Class 2, Class 3, and Class 4.\"}}"}
{"file_name": "Normal (20).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Analog retrieval is learning then Sampling and If Sampling is Self-supervised learning then Analogical Inference. If Analogical Inference is Intersection then End.\"}}"}
{"file_name": "Normal (21).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Activities is connected with Atmosphere and Consumption of fossil energy. Consumption of fossil energy is then connected with Emission of primary pollutants which is further connected with both Transformation and transport of pollutants and pollutants. Also, Transformation and transport of pollutants is connected with pollutants which is then connected with both Exposure to pollutants and Effects of pollution. Also, Exposure to pollutants is connected with Effects of pollution. Effects of pollution is then connected with Effects on vegetation, Effects on fauna, human and animal health, and Effects on biotopes.\"}}"}
{"file_name": "Normal (22).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Got the first dose? is Yes then 1 dose and if Got the first dose? is No/Don't know then Got second dose?. If Got second dose? is Yes then 1 dose and if Got second dose? is No/Don't know then 2 doses.\"}}"}
{"file_name": "Normal (23).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Connection is Error then Calculations which if Calculations is Output then System and if System is Sensor then again connection.\"}}"}
{"file_name": "Normal (24).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Application is connected with Plan & design worload & jobs to be executed which is then connected with Prepare Custom Script/Clients which is further connected with Run Tests and analyze. Run Tests and analyze is connected with Eror which is then connected with both Revising and Finalize Configuration. Also, Revising is connected with Run Tests and analyze.\"}}"}
{"file_name": "Normal (25).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Frequency Mixer is connected with both Power and Local Oscillator. Power is then connected with Bandpass 2MHz, Bandpass Filter 0MHz, and Bandpass Filter. Bandpass 2MHz is connected with Frequency Mixer which is then connected with Finish. Bandpass Filter 0MHz is connected with Power Splitter. Bandpass Filter is connected with Frequency which is then connected with Finish. Power Splitter is then connected with both Frequency Mixer and Frequency.\"}}"}
{"file_name": "Normal (26).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"board is connected with Lighting, Power, and General power. Power is then connected with Conveyer 1 which is further connected with Processing which is finally connected with Conveyer.\"}}"}
{"file_name": "Normal (27).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Start is Brainstorm then Topic assigned which if Topic assigned is Outline then Discuss. If Discuss is Return then Topic assigned and if Discuss is Draft then Draft review. If Draft review is changes then Discuss and if Draft review is Approved then Finish.\"}}"}
{"file_name": "Normal (28).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Get N from user which is then connected with Initialize which is further connected with I is greater than N. If I is greater than N is Yes then Show Sum on output which is then connected with End and if I is greater than N is No then Add I to Sum which is then connected with Update which is further connected with I is greater than N.\"}}"}
{"file_name": "Normal (29).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Development Plan which is then connected with Form a Team which is further connected with Give contract. Give Contract is connected with Planning which is then connected with Estimate cost which is further connected with Tender pas. Tender pass is connected with Finalize which is finally connected with Finish.\"}}"}
{"file_name": "Normal (30).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Information input transducer is connected with Source encoder which is then connected with Channel encoder which is further connected with Digital. Digital is connected with Amplifier which is then connected with demodulator which is further connected with Channel decoder. Channel decoder is connected with Source decoder which is finally connected with Output transducer.\"}}"}
{"file_name": "Normal (31).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Source is connected with Transmitter which is then connected with Transmission channel which is further connected with Receiver. Receiver is connected with Destination. Also, Amplifier is connected with Transmission channel.\"}}"}
{"file_name": "Normal (32).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Create Document is connected with Document which is connected with Manager Approval. Manager Approval is connected with Approval Decision which if Approval Decision is Approve then Onboard and if Approval Decision is Reject then again Create Document.\"}}"}
{"file_name": "Normal (33).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Movie is connected with has subtitles which if has subtitles is No then Ask someone and if has subtitles is Yes then Type. If Type is Single then Summarize based on selected algorithm and if Type is Combined then Crate new algorithm. Also, Summarize based on selected algorithm and Crate new algorithm both are connected with Generate the summarized video.\"}}"}
{"file_name": "Normal (34).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Initialize which is then connected with Decision. If Decision is No then Update which is further connected with Initialize and if Decision is Yes then End.\"}}"}
{"file_name": "Normal (35).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Initial is connected with Fitness Computation which is then connected with both Fitness and Converged?. If Converged? is YES then STOP and if Converged? is NO then Reproduction which is further connected with New Generation which is finally connected with Fitness Computation.\"}}"}
{"file_name": "Normal (36).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Fill the bath with water which is then connected with Add warm water which is further connected with Get into bath. Get into bath is connected with Wash which is then connected with Come Out which is further connected with Empty the bath water. Empty the bath water is connected with Get dressed which is finally connected with End.\"}}"}
{"file_name": "Normal (37).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Are you happy? which if Are you happy? is Yes then Make others happy which is further connected with Stop and if Are you happy? is No then Want to be happy? and if Want to be happy? is Yes then Ask someone which is then connected with Stop and if Want to be happy? is No then all over which is finally connected with Start.\"}}"}
{"file_name": "Normal (38).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with ACCEPT INPUT FROM USER which is then connected with CONDITION for(i=1;i<=a;i++) which if CONDITION for(i=1;i<=a;i++) is CONDITION is FALSE then PRINT VALUE OF FACTORIAL and if CONDITION for(i=1;i<=a;i++) is CONDITION is TRUE then Process. Process is then connected with both CONDITION for(i=1;i<=a;i++) and PRINT VALUE OF FACTORIAL which is finally connected with STOP.\"}}"}
{"file_name": "Normal (39).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Initialize which is then connected with L=p.l which is further connected with Print which is finally connected with End.\"}}"}
{"file_name": "Normal (40).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Are you happy? which if Are you happy? is Yes then Very good, have a great day! which is further connected with Finish and if Are you happy? is No then Want to be happy? which is then connected with Very good, Then you are already happy which is further connected with Finish. Also, If Want to be happy? is No then Stay fit which is finally connected with Start.\"}}"}
{"file_name": "Normal (41).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Initialize which is then connected with CHECK CONDITION. If CHECK CONDITION is Condition is TRUE then Initialize and if CHECK CONDITION is Condition is FALSE then EXIT LOOP which is finally connected with STOP.\"}}"}
{"file_name": "Normal (42).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Set of input images is connected with conversion which is connected with DWT which is further connected with Feature extraction. Feature extraction is connected with Feature matching algorithm. images are connected with Feature extraction which is then connected with Feature matching algorithm which is finally connected with results.\"}}"}
{"file_name": "Normal (43).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Global is UART then Bluetooth and if Bluetooth is I2C then Accelerometer and also Battery Monitor. If USB Connector is 5V then Battery which is then connected with LiPo Battery and if LiPo Battery is 3.7V then Battery Monitor. Also, LiPo Battery is further connected with Voltage Regulator.\"}}"}
{"file_name": "Normal (44).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"modulation mapping is connected with EE operation which is then connected with pilot/DC/guard band insertion which is further connected with CP insertion. CP insertion is connected with iF which is then connected with analog gain control which is further connected with front-end. front-end is connected with Channel which is then connected front-end which is further connected with analog gain control. analog gain control is connected with correction which is then connected with Synchronization+CFO estimation which is again connected with correction. Also, Synchronization+CFO estimation is connected with removal which is then connected with Add which is further connected with EEE operations which is finally connected with channel estimation.\"}}"}
{"file_name": "Normal (45).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with A=1 which is then connected with A<=10? which if A<=0? is F then End and if A<=10? is T then Print A which is further connected with A=A+1. A=A+1 is connected with A<=10? and End.\"}}"}
{"file_name": "Normal (46).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Initial Population which is then connected with Fitness Evaluation which is further connected with Tournament Selection. Tournament Selection is connected with Team Selection which is then connected with Finalize Team which is further connected with New Generation. New Generation is connected with condition fulfil? which if condition fulfil? is YES then connector and if condition fulfil? is NO then again Tournament Selection.\"}}"}
{"file_name": "Normal (47).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Initial setting is Traffic monitoring then Start analysis mode which is further connected with Condition?. If Condition is Yes then Drop packet which is then connected with Initial setting. Also, Condition? is connected with Normal network status which is finally connected with Initial setting.\"}}"}
{"file_name": "Normal (48).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Source is connected with Electrical Transmit which is then connected with Optical which is further connected with fibre cable. Fibre cable is connected with Demodular which is then connected with receiver which is finally connected with Destination.\"}}"}
{"file_name": "Normal (49).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If King? is Yes then Sven is not currently King and if King? is No then Is Sven the current heir?. If Is Sven the current heir? is Yes then Sven is not currently King and if Is Sven the current heir? is No then Ask Queen\"}}"}
{"file_name": "Normal (50).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Make coffee which is then connected with Browse the web? which if Browse the web? is Yes then Make coffee and if Browse the web? is No then Okay then which is further connected with See you later which is finally connected with Thing done.\"}}"}
{"file_name": "Normal (51).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Generate Initial Population which is then connected with Compute the fitness of each individual which is further connected with Check all person. Check all person is connected with Categorize them which is then connected with Converging?. If Converging is NO then Compute the fitness of each individual and if Converging is YES then End.\"}}"}
{"file_name": "Normal (52).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Applications is connected with Check manual which is then connected with libVA API which is further connected with Processor. Processor is connected with driver which is then connected with Firmwares and Graphics Card. Also, Firmwares is connected with Graphics Card.\"}}"}
{"file_name": "Normal (53).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Download game which is then connected with Update Game. Update Game is connected with Render game state onto window which is then connected with Process which is further connected with Is window still open?. If Is window still open? is Yes then Update Game and if Is window still open? is No then Application Shutdown.\"}}"}
{"file_name": "Normal (54).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Mobile Switch on which is then connected with GPS senses motion which is further connected with GPS and phone. GPS and phone is connected with Give location which is then connected with GPS notifies Police. Further, GPS notifies Police is connected with both Server tracks GPS and Cell phone tracks GPS.\"}}"}
{"file_name": "Normal (55).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Transformer is connected with Rectifier which is then connected with Regulator which is further connected with ARDUINO. Sensor is connected with ARDUINO which is then connected with Crystal glass which is finally connected with LED PANNEL.\"}}"}
{"file_name": "Normal (56).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Temperature is connected with Arduino which is then connected with both LCD and Home Automation.\"}}"}
{"file_name": "Normal (57).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Money is Delivery Dispatch then Depots which if Depots is Indents then Money. Also, Depots is connected with Distributors which is then connected with Retailers which is finally connected with Consumers.\"}}"}
{"file_name": "Normal (58).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Initialize which is then connected with Average=(num1+num2)/2 which is further connected with Print Average which is finally connected with End.\"}}"}
{"file_name": "Normal (59).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input Devices is connected with Process which is then connected with Output Devices and Memory is also connected with Process.\"}}"}
{"file_name": "Normal (60).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Source is connected with Amplification which is then connected with Process which is further connected with Demodulator which is finally connected with Target.\"}}"}
{"file_name": "Normal (61).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input Salary which is then connected with Find Increase in salary. Find Increase in salary is connected with Add increase to salary which is then connected with Print result which is finally connected with End.\"}}"}
{"file_name": "Normal (62).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Design a Postcard which is then connected with Customer like it? which is then connected with Yes and No.\"}}"}
{"file_name": "Normal (63).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Enter measurements which is then connected with Input Width which is further connected with Input value of Long. Input value of Long is connected with Input Long which is then connected with Width*Long. Width*Long is connected with Area of a Rectangle which is finally connected with End.\"}}"}
{"file_name": "Normal (64).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Dinosaur dies is connected with Body found? which if Body found? is Yes then Scientist do some experiments on it? and if Body found? is No then Dinosaur is eaten or rots and no fossil is formed. If Scientist do some experiments on it? is YES then Find many intersting facts about Dianosaur and if Scientist do some experiments on it? is NO then Dinosaur rots and no fossil is formed.\"}}"}
{"file_name": "Normal (65).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Awkward? is connected with both No and Yes. If No then Stay and if Yes then Talk with others. Talk with others is connectedw ith both Yes and No. If Yes then Stay and if No then Leave.\"}}"}
{"file_name": "Normal (66).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with Lapping which is then connected with Die sawing which is further connected with Die bonding. Die bonding is connected with Wire which is then connected with Molding which is further connected with Marketing. Marketing is connected with Plating which is then connected with sampling which is further connected with Forming which is finally connected with End.\"}}"}
{"file_name": "Normal (67).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Reviewer is connected with Taking feedback from others which is then connected with Final comments which is further connected with Document selection. Document selection is connected with Selection rounds which is further connected with Introduction, Coding Test, Tech Interview, and HR Interview.\"}}"}
{"file_name": "Normal (68).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start / reset is connected with Bootloader button pressed? which if Bootloader button pressed? is Yes then Firmware upgrade mode and if Bootloader button pressed? is No then Init variables and constants which is further connected with Configure chip. Also, Pin config data is connected with Configure chip which is then connected with Initialize. Initialize is connected with Process which is then connected with New message from host? which if New message from host? is No then Background tasks and if New message from host? is Yes then Process request message. Process request message is connected with Send response message to host which is further connected with Background tasks which is finally connected with Process.\"}}"}
{"file_name": "Normal (69).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Find changes in work which is then connected with Approval. If Approval is No then Ignore change and if Approval is Yes then Method which is then connected with Agree?. If Agree? is Yes then Expand and if Agree? is No then Discard. Expand, Discard, and Ignore change all are connected with END.\"}}"}
{"file_name": "Normal (70).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Vibration signal is connected with Separate noise from the signal which is then connected with Processing on signal which is further connected with Calculation of every value to find amplification which is finally connected with End the process.\"}}"}
{"file_name": "Normal (71).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Signal is connected with Real-time algorithm which is then connected with Amplification which is further connected with Hybrid Thresholding Criterion. Hybrid Thresholding Criterion is connected with Noise Removal which is further connected with Denoise Signal.\"}}"}
{"file_name": "Normal (72).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Would you do anything for love is Yes then Even that? and if Would you do anything for love is No then In Love. Even that? is connected with both Depends and Yes, even that. Depends is further connected with Not in love and Yes, even that is connected with In Love.\"}}"}
{"file_name": "Normal (73).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input 3D Coordinates of atomic nuclei is connected with both Different parts of nuclei and Formation. Different parts of nuclei is connected with Formation which is then connected with Diagonalization which is further connected with Converged?. If Converged? is Yes then Calculate Properties End and if Converged? is No then Formation.\"}}"}
{"file_name": "Normal (74).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Is it food? is No then Try to eat it immediately and if Is it food? is Yes then First heat it.\"}}"}
{"file_name": "Normal (75).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"CMTS receives an IP or ARP frame on an upstream interface is connected with Attach all the wires from the circuit and fix all the component which is then connected with Is cable-source verify activated. If Is cable-source verify activated is No then Let the packet through for further processing. Also, Is cable-source verify activated is connected with Is there an entry in the CPE database which if Is there an entry in the CPE database is Yes then 2 and if Is there an entry in the CPE database is No then 3.\"}}"}
{"file_name": "Normal (76).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Enter Website which is then connected with Homepage which is further connected with Enter Details. Enter Details is connected with Correct? which if Correct? is No then Enter Again which is further connected with Enter Details and if Correct? is Yes then Enter which is then connected with Stop.\"}}"}
{"file_name": "Normal (77).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Enter Details is connected with Confirmation which is then connected with Attempts? which if Attempts? is Yes then Display and if Attempts? is No then Confirmation.\"}}"}
{"file_name": "Normal (78).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Login Page which if Login Page is No then Reconfirm and if Login Page is Yes then Check which is then connected with NewsFeed. Also, Reconfirm is connected with Login Page. NewsFeed is connected with Like which is further connected with End.\"}}"}
{"file_name": "Normal (79).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Connector is connected with Check Time which is then connected with Before 4 pm? which if Before 4 pm? is Yes then Home and if Before 4 pm? is No then Office. Office is then connected with Check which is further connected with Before 7 pm?. If Before 7pm? is No then again Office and if Before 7pm? is Yes then School which is finally connected with End.\"}}"}
{"file_name": "Normal (80).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Office is connected with home.\"}}"}
{"file_name": "Normal (81).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Strat is connected with Collide which is then connected with Wake up which is further connected with Run which is finally connected with End.\"}}"}
{"file_name": "Normal (82).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Add which is then connected with Sub. Sub is then connected with both Update and Print. Also, both Update and Print are connected with Stop.\"}}"}
{"file_name": "Normal (83).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Converter is connected with Boost Converter and also Monitor is connected with Boost Converter.\"}}"}
{"file_name": "Normal (84).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Worker is connected with Disease which is then connected with Consult. Consult is then connected with Explain everything which is then connected with Surgery which is finally connected with End.\"}}"}
{"file_name": "Normal (85).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Assessment is connected with Team work which is then connected with Work which is further connected with Gather. Gather is connected with Complete which is then connected with Closure. Closure is connected with both Primary closure and Bandaging. Bandaging is then connected with both Delayed primary closure and Secondary closure.\"}}"}
{"file_name": "Normal (86).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Intro is connected with Display message which is then connected with Return.\"}}"}
{"file_name": "Normal (87).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"bootstrap is connected with Installation which is then connected with Copy which is further connected with Unpack. Unpack is connected with Register which is then connected with Config. Config is further connected with Zip, Image and ISO.\"}}"}
{"file_name": "Normal (88).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"TV not working is connected with Switch On? which if Switch On? is No then Switch on and if Switch On? is yes then Power supply?. If Power supply? is No then Wait for power and if Power supply? is Yes then Finish.\"}}"}
{"file_name": "Normal (89).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Program is connected with Logical Plan which is then connected with Physical Plan which is further connected with Map-Reduce Plan which is finally connected with Execution.\"}}"}
{"file_name": "Normal (90).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input is connected with Request which is then connected with Session which is further connected with Control. Control is connected with Process which is then connected with LEVEL POSITIONING which is further connected with OUTPUT DISPLAY. Also, Access is connected with OUTPUT DISPLAY.\"}}"}
{"file_name": "Normal (91).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input is connected with Signal Conditioning which is then connected with CPU whcih is further connected with Power Electronics. Actuator Power Supply is also connected with Power Electronics. Power Supply is then connected with Input, Signal Conditioning, and CPU.\"}}"}
{"file_name": "Normal (92).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Sensor is connected with Arduino which is then connected with Home automation.\"}}"}
{"file_name": "Normal (93).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Signal is connected with Mapping which is then connected with Amplification which is finally connected with Induction.\"}}"}
{"file_name": "Normal (94).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Get ready for bath which is then connected with Remove clothes which is further connected with Get into bath. Get into bath is connected with Wash which is then connected with Get out of bath. Get out of bath is connected with Switch off the light which is finally connected with Get dressed.\"}}"}
{"file_name": "Normal (95).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Go to kitchen which is then connected with Find food which is further connected with Microwave it. Microwave is connected with Switch off light which is then connected with Get out of kitchen which is finally connected with Enjoy dinner.\"}}"}
{"file_name": "Normal (96).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Dead body is connected with EMG Electrode which is then connected with Amplifier which is then connected with EMG Recorder. Also, Amplifier is connected with both Oscilloscope and AF Amplifier.\"}}"}
{"file_name": "Normal (97).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"REST API is connected with pre process which is then connected with document-filter-topic which is further connected with document-converter. document-converter is connected with document-converter-topic which is further connected with Topic. Topic is then connected with both publisher-topic and workflow.\"}}"}
{"file_name": "Normal (98).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Topic is connected with Power signal which if Power signal is Stream then Processor and if Processor is also Stream then Output which is finally connected with End.\"}}"}
{"file_name": "Normal (99).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Kitchen is connectedw ith Open fridge which is then connected with Cook yourself which is then connected with Enjoy which is finally connected with Kitchen.\"}}"}
{"file_name": "Normal (100).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Initialize which is then connected with SUM=A+B. SUM=A+B is connected with PRINT VALUE OF SUM which is finally connected with STOP.\"}}"}
{"file_name": "Normal (101).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Inputs are connected with Arduino Uno which is then connected with IOT, LCD, and also Process. Process is then connected with both Motor and Pump.\"}}"}
{"file_name": "Normal (102).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Goals, Planning, Trust, Action, Result all are connected with Winning.\"}}"}
{"file_name": "Normal (103).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input is connected with Filtering which is then connected with Connect ribs which is further connected with Skeleton which is finally connected with Segmentation Using Level set.\"}}"}
{"file_name": "Normal (104).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Input which is then connected with PROCESS which is further connected with Display which is finally connected with END.\"}}"}
{"file_name": "Normal (105).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Take all the inputs which is then connected with Assign each variable which is then connected with Calculate loss which is further connected with Reduce loss. Reduce loss is connected with Search vector which is then connected with Update values. Update values is then connected with Converge? which if Converge? is No then Calculate loss and if Converge? is Yes then Exit.\"}}"}
{"file_name": "Normal (106).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Tuner is connected with Mixer. Also, Noise is connected with Mixer which is then connected with IF Amplifier which is further connected with Detector which is finally connected with AF Amplifier.\"}}"}
{"file_name": "Normal (107).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read which is then connected with Update value which is further connected with Print. Print is connected with X>0 which if X>0 is YES then Update value and if X>0 is NO then End.\"}}"}
{"file_name": "Normal (108).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Application is connected with Login which is then connected with Apply which is further connected with Shortlist resumes. Shortlist resumes is connected with E-mail resumes to departments which is then connected with Resumes approved? which if Resumes approved? is No then Screen more resumes which is further connected with E-mail resumes to departments and if Resumes approved? is Yes then Call for Interview which is finally connected with End hiring Stage 1.\"}}"}
{"file_name": "Normal (109).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Lamp doesn't work is connected with Want more Lamp? which if Want more Lamp? is No then Plug in lamp and if Want more Lamp? is Yes then Bulb burned out?. If Bulb burned out? is Yes then Replace bulb and if Bulb burned out? is No then Repair lamp.\"}}"}
{"file_name": "Normal (110).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Draw shapes easily is connected with Your chart adjusts automatically which is then connected with Present it.\"}}"}
{"file_name": "Normal (111).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Idea is connected with Program which is then connected with Python and C++.\"}}"}
{"file_name": "Normal (112).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Payment gateway which is then connected with Enter your amount and mode which is further connected with Enter code. Enter code is connected with Select gateway which is then connected with Converging? which if Converging? is No then Enter your amount and mode and if Converging? is YES then End.\"}}"}
{"file_name": "Normal (113).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Are you happy? which if Are you happy? is Yes then Nice which is then connected with End and if Are you happy? is No then Want to be happy? which is then connected with Laugh and finally connected with End. Also, if Want to be happy? is No then All over again which is then connected with Start.\"}}"}
{"file_name": "Normal (114).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Are you happy? which is then connected with both Good and Want to be happy?\"}}"}
{"file_name": "Normal (115).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Dyed and Finished Fabric in Roll is connected with Fabric Inspection which is then connected with Authentication. Authentication is connected with Different Tests of Fabric which is then connected with Test Cutting which is further connected with Confirmation which is finally connected with Input to Cutting Section.\"}}"}
{"file_name": "Normal (116).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Take Inputs which is then connected with Perimeter=2*(length+width) which is further connected with Print the perimeter which is finally connected with END.\"}}"}
{"file_name": "Normal (117).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input which is then connected with C=5/9*(F-32) which is further connected with Display which is finally connected with End.\"}}"}
{"file_name": "Normal (118).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Work flow is connected with model estimator which is then connected with model merger which is further connected with region classifier. Region classifier is connected with region splitter which is then connected with Extract which is further connected with region generator which is finally connected with model estimator.\"}}"}
{"file_name": "Normal (119).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Input variables which is then connected with C=(F-32)*519 which is further connected with Display all variables which is finally connected with STOP.\"}}"}
{"file_name": "Normal (120).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with count=0 which is then connected with Operation which is further connected with count=count+1. count=count+1 is connected with Is count<10 which if Is count<10 is YES then Operation and if Is count<10 is NO then Stop.\"}}"}
{"file_name": "Normal (121).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input is connected with Vibration signal which is then connected with OCR which is further connected with MBS. MBS is connected with Fault Features. Faults, Fault Features and Fault causes all are connected with Bayesian diagnostic network which is finally connected with Diagnostic results.\"}}"}
{"file_name": "Normal (122).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"PV array is connected with Power which is then connected with Distribution pannel. Distribution pannel is then connected with both AC loads and Electricity utility.\"}}"}
{"file_name": "Normal (123).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Power is connected with TV which is then connected with Output Devices. Also, Remote is connected with TV.\"}}"}
{"file_name": "Normal (124).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with FLOWCHART which if FLOWCHART is YES then again FLOWCHART.\"}}"}
{"file_name": "Normal (125).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Traffic rules is connected with Check colour of light which is then connected with Light green, Light orange, and Light red. Light green is then connected with Go. Light orange is connected with Don't speed and Light red is connected with Stop. Don't speed is then connected with Go and Stop.\"}}"}
{"file_name": "Normal (126).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read Temperature which is then connected with Temperature<32? which if Temperature<32? is YES then Not so cold and if Temperature<32? is NO then Cold. Also, Not so cold and Cold both are connected with End.\"}}"}
{"file_name": "Normal (127).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Food poision, virus, and Toxic item all are connected with Damaged bone marrow which is then connected with Inability to digest food. Inability to digest food is connected with Anemia, neutropenia, and thrombocytopenia which is then connected with Infection, bleeding which is finally connected with high risk.\"}}"}
{"file_name": "Normal (128).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Paper review is connected with Correction which if Correction is Implement then Was the article important?. IF Was the article important? is Yes then Was the changes worth it? and if Was the article important? is No then New changes. If Was the changes worth it? is Disagree then Seek the changes and if Seek the changes is Wait then Correction. If Was the changes worth it? is Agree then New changes.\"}}"}
{"file_name": "Normal (129).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Raw materials is connected with Addition of water containing yeast which is then connected with Kneading which is further connected with Proofing. Proofing is connected with Read again which is then connected with Proofing (30 min) which is further connected with Filling in greased pan which is finally connected with Proofing (35 min.).\"}}"}
{"file_name": "Normal (130).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input which is then connected with C<10? which if C<=10? is F then End and if C<0? is T then Output. Output is then connected with C=C+1 which is then connected with both C<=10? and End.\"}}"}
{"file_name": "Normal (131).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Logo is connected with both Hardcopy and Softcopy. Hardcopy is connected with Quality and paper material. Softcopy is connected with Copyright and privacy.\"}}"}
{"file_name": "Normal (132).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Inputs which is then connected with Find Area which is further connected with Display which is finally connected with Stop.\"}}"}
{"file_name": "Normal (133).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Data process is connected with Degree calculation which is then connected with Area calculation which is further connected with Similarity calculation. Similarity calculation is connected with Core calculation which is connected with Dimension expansion which is finally connected with Finish.\"}}"}
{"file_name": "Normal (134).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Planning is connected with In progress which is then connected with review which is finally connected with Done.\"}}"}
{"file_name": "Normal (135).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Design a novel is connected with Is the design based on a template? which is further connected with both Yes and No.\"}}"}
{"file_name": "Normal (136).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input which is then connected with C=A+B which is further connected with Print A which is finally connected with End.\"}}"}
{"file_name": "Normal (137).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input which is then connected with C=A+B which is further connected with Print B which is finally connected with End.\"}}"}
{"file_name": "Normal (138).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Session Object is connected with GetQuery() which is then connected with Input variables which is then connected with both Process and Read or make changes. Read or make changes is connected with Save() which is then connected with both Process and Close(). Process is then connected with Close() which is further connected with Finish.\"}}"}
{"file_name": "Normal (139).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start-up is connected with Input variables which is then connected with Operator which is further connected with Main function. Main function is connected with MPU WDT1 setup which is then connected with Configuration which is finally connected with Finish.\"}}"}
{"file_name": "Normal (140).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read Temperature which is then connected with Check Temperature which if Check Temperature is YES then Print \"Below Freezing\" and if Check Temperature is NO then Print \"Above Freezing\". Also, both Print \"Below Freezing\" and Print \"Above Freezing\" are connected with End.\"}}"}
{"file_name": "Normal (141).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"start is connected with Input data user which is then connected with Enter ID which is further connected with Authentication. Authentication is connected with Memory which is then connected with Result which is finally connected with end.\"}}"}
{"file_name": "Normal (142).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"STORAGE is connected with Separation which is then connected with MILLING which is further connected with HULLS GRINDING. HULLS GRINDING is connected with DRY EXTRUDING which is then connected with FULL PRESSING which is then connected with both Waste removal and OIL CLARIFICATION. Waste removal is connected with CAKE STORAGE and OIL CLARIFICATION is connected with CRUDE OIL STORAGE.\"}}"}
{"file_name": "Normal (143).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Enter numbers which is then connected with Process. Process is connected with Output which is finally connected with end.\"}}"}
{"file_name": "Normal (144).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Worker (as the victim) is connected with Family members which is then connected with Loss of earning capacity which is further connected with Pain & Suffering. Pain & Suffering is connected with Family issue which is finally connected with Changed Social Life.\"}}"}
{"file_name": "Normal (145).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Data Collection is connected with Conceptual Model Construction which is then connected with Sufficient Data? which if Sufficient Data? is No then Data Collection and if Sufficient Data? is Yes then Groundwater Flow which is further connected with Liberal?. If Liberal is No then Groundwater Flow and if Liberal? is Yes then Contaminant Transport which is further connected with Adequate?. If Adequate? is No then Contaminant Transport and if Adequate? is Yes then Predictive Simulations.\"}}"}
{"file_name": "Normal (146).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Input which is then connected with Area = Width*Height which is further connected with Height which is finally connected with Stop.\"}}"}
{"file_name": "Normal (147).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Online search and retrieving of articles is connected with 117 articles which is then connected with Evaluation of articles which is further connected with articles with no full text or duplicates, articles met the inclusion and Chinese language. articles met the inclusion is connected with Sort them by numbers which is then connected with Summaries of papers which is finally connected with Development.\"}}"}
{"file_name": "Normal (148).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Strat is connected with Initialize parameters of particle swarm which is then connected with Calculate the fitness function which is then connected with Compare with others fitness. Compare with others fitness is connected with Update the global best position of particle swarm which is then connected with Find overall performance which is further connected with Does it satisfy the termination conditions?. If Does it satisfy the termination conditions? is N then Calculate the fitness function and if Does it satisfy the termination conditions? is Y then Display the results which is finally connected with End.\"}}"}
{"file_name": "Normal (149).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Data acquistion for vibration signal is connected with Pressue control unit which is then connected with Characteristic frequency exits. If Characteristic frequency exits is NO then Normal condition and if Characteristic frequency exits is YES then Characteristic not exist. If Characteristic not exist is YES then Not Good condition and if Characteristic not exist is NO then Blade with crack.\"}}"}
{"file_name": "Normal (150).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Initialization is connected with System update Time-updating which is then connected with DVL Availble? which if DVL Availble is N then System update Time-updating and if DVL Availble is Y then Measurement-updating. Measurement-updating is connected with Alingment Over? which if Alignment Over? is N then System update Time-updating and if Alignment Over? is Y then End.\"}}"}
{"file_name": "Normal (151).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Time Series Gateway is connected with Initialize which is then connected with Compare Time Series which is further connected with Different. If Different is Yes then Analyze Time Series Difference and if Different? is No then t=N-1. Also, Analyze Time Series Difference is connected with Determine Change Date which is then connected with t=N-1. If t=N-1 is No then Compare Time Series and if t=N-1? is Yes then Output Changed Dates.\"}}"}
{"file_name": "Normal (152).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Patient requests is connected with both Patient is not eligible and Doctor. Patient is not eligible is connected with Procedure not executed. Doctor is then connected with both Healthcare Brain doctor and Healthcare Heart doctor. Healthcare Brain doctor is connected with Find replacement and Healthcare Heart doctor is connected with Procedure executed. Find replacement is connected with both Replacement not found and Replacement found. Replacement not found is connected with Call another hospital and Replacement found is connected with Procedure executed.\"}}"}
{"file_name": "Normal (153).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Administrator which is then connected with both Admin two and Admin one. Admin two is connected with User One and Login. Admin one is connected with User Four and Unknown. Login is connected with Secret Question and Unknown is connected with Database.\"}}"}
{"file_name": "Normal (154).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START is connected with Do you understand English? which if Do you understand English? is YES then GOOD which is further connected with LET'S GO DRINK and if Do you understand English? is NO then OKAY, YOU SEE THE LINE LABELED \"YES\"?. If OKAY, YOU SEE THE LINE LABELED \"YES\"? is YES then ..AND YOU CAN SEE THE ONES LABELED \"NOT\"? which if ..AND YOU CAN SEE THE ONES LABELED \"NOT\"? is YES then GOOD and if ..AND YOU CAN SEE THE ONES LABELED \"NOT\"? is NO then BUT YOU JUST FOLLOWED THEM TWICE!. And if OKAY, YOU SEE THE LINE LABELED \"YES\"? is NO then BUT YOU SEE THE ONES LABELED \"NO\". If BUT YOU SEE THE ONES LABELED \"NO\" is YES then Okay and if BUT YOU SEE THE ONES LABELED \"NO\" is NO then LISTEN which is then connected with I HATE YOU. If BUT YOU JUST FOLLOWED THEM TWICE! is YES then (THAT WASN'T A QUESTION.) which is then connected with SCREW IT which is further connected with LET'S GO DRINK. If LET'S GO DRINK is 6 DRINKS then I should go home. Also, if BUT YOU JUST FOLLOWED THEM TWICE! is NO then (THAT WASN'T A QUESTION.).\"}}"}
{"file_name": "Normal (155).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Case status changes is connected with Approval triggered which is then connected with Is the approval applied to the case?. If Is the approval applied to the case? is Yes then Self-approval configured? and if Is the approval applied to the case? is No then Change the case. If Self-approval configured? is No then Approval flow configured? and if Self-approval configured? is Yes then Case status change which is further connected with Task status changes based on approval mapping. If Approval flow configured? is Yes then Task sent to approver which is further connected with Approver make decision and if Approval flow configured? is No then Task status changes based on approval mapping.\"}}"}
{"file_name": "Normal (156).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Admission records Authentication and Transfer Admission records Authentication both are connected with Records after duplicates removed which is then connected with Records screened. Records screened is then connected with both Records excluded and Full-text articles assessed for eligibility. Full-text articles assessed for eligibility is then connected with both Full-text articles excluded, with reasons and Assessment result of each article.\"}}"}
{"file_name": "Normal (157).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Identify the Change is connected with Engineering Change request Approval which is then connected with Approval. If Approval is Rejected then Engineering Change request Approval and if Approval is Approved then Engineering Change Order Approval which is further connected with Change Implementation which is finally connected with Engineering Change Release Note.\"}}"}
{"file_name": "Normal (158).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Inspection for toxic drugs in each house is connected with Team selection for different Inspection which is then connected with Agree and describe domains and subdomains which is further connected with Panel review and feedback. Panel review and feedback is connected with Consensus which if Consensus is No then Panel review results, implemented changes which is further connected with Agree and describe domains and subdomains. If Consensus is Yes then Summarize results which is then connected with Feedback which is further connected with Consensus. If Consensus is No then Panel review results, implement changes which is further connected with Feedback and if Consensus is Yes then Publish results.\"}}"}
{"file_name": "Normal (159).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Identify Problem is connected with User \"Issues\" which if User \"Issues\" is No then Browser Issue and if User \"Issues\" is Yes then Login Fixed. If Browser Issue is Yes then Different Browser and if Browser Issue is No then Platform Issue which if Platform Issue is No then Import Settings and if Platform Issue is Yes then Use Different Platform. If Import Settings is No then Settings and if Import Settings is Yes then use different version. If Settings is No then Content Issue and if Settings is Yes then Adjust Settings and if Content Issue is Yes then Change Content.\"}}"}
{"file_name": "Normal (160).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Begin is connected with i=0 which is then connected with Assign operations to variables which is further connected with Generate 'k' test samples. Generate 'k' test samples is connected with Compute a which is then connected with a>l which if a>l is No then i=i+1 and if a>l is Yes then User is located in location i. i=i+1 is connected with i>M which if i>M is Yes then Display i and if i>M is No then Assign operations to variables.\"}}"}
{"file_name": "Normal (161).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Random Initialization is connected with Operation on counter which is then connected with Compute the Objective function which is further connected with Update Velocity. Update Velocity is connected with Update individual best if needed which is then connected with Update Position which is further connected with Store position in new variable. Store position in new variable is connected with Stopping criteria which if Stopping criteria is No then Operation on counter and if Stopping criteria is Yes then Finish.\"}}"}
{"file_name": "Normal (162).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"literature reference is connected with Identify relevant sources which is then connected with Collect specific data which is further connected with Available data determination Is there missing data?. If Available data determination Is there missing data? is Yes then Smart toolkit and if Available data determination Is there missing data? is No then Emission factor. Smart toolkit is connected with Emission factor which is finally connected with specific emission inventory.\"}}"}
{"file_name": "Normal (163).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Select Topic is connected with Background Search which is then connected with Develop Search Strategy which is further connected with Task assign. Task assign is connected with Evaluate Information for Accuracy Reliability which is then connected with Discuss with others which is further connected with Revision of Paper. Revision of Paper is then connected with both Report and Submit.\"}}"}
{"file_name": "Normal (164).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Simulation of OCR system with nano-fluid is connected with Note all the records of fluid which is then connected with Preparation of the nano-fluids. Preparation of the nano-fluids is connected with Testing of fluid in Lab which is then connected with Real life ORC in Hybrid OTEC implementation with nano-fluid which is finally connected with Submit the progress.\"}}"}
{"file_name": "Normal (165).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read Inputs which is then connected with Calculate S. Calculate is connected with Calculate area=sqrt(s*(s-a)*(s-b)*(s-c)) which is then connected with Print area which is finally connected with End.\"}}"}
{"file_name": "Normal (166).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input Image is connected with Image Enhancement which is then connected with Image Segmentation which is further connected with Cropping ROI Manually, Threshold and region based technique, and NCNNN. NCNNN is connected with Testing which is finally connected with Evaluation.\"}}"}
{"file_name": "Normal (167).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Application Start is connected with Close other apps which is then connected with Update Game which is further connected with Render game state onto window. Render game state onto window is connected with Process events from window which is then connected with Does game lag? which if Does game lag? is Yes then Update Game and if Does game lag? is No then Application Shutdown.\"}}"}
{"file_name": "Normal (168).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"BEGIN is connected with Enter Limit which is then connected with Initialize number which is further connected with Set Sum equal to 0. Set Sum equal to 0 is connected with Do which is further connected with If Sum>Limit which if Sum>Limit is true then Display Number and Sum. If Sum>Limit is false then Update values which is further connected with Decrease loss. Decrease loss is then connected with DO and also DIsplay Number and Sum is connected with END.\"}}"}
{"file_name": "Normal (169).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Vibration signal is connected with Dicompose the signal into different components which is then connected with Obtain the order of component according to size which is further connected with Calculate the significance indicator and further construct the fault sensitive matrix which is finally connected with Identify fault type and find out the optimal IMF to fault.\"}}"}
{"file_name": "Normal (170).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Exploration is connected with Drilling and blasting which is then connected with Mining which is further connected with Separation. Separation is connected with Refining which is finally connected with Distribution.\"}}"}
{"file_name": "Normal (171).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Information source is connected with Amplifier which is then connected with Channel. Also, Noise source is connected with Channel which is then connected with Receiver which is finally connecte dwith Destination.\"}}"}
{"file_name": "Normal (172).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Read Inputs which is then connected with Let Factor=1, I=1 which is further connected with I is greater than N. If I is greater than N is Yes then Show Factor on output which is then connected with End and if I is greater than N is No then Update which is then connected with Add 1 to I which is further connected with I is greater than N.\"}}"}
{"file_name": "Normal (173).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Raw Materials is connected with Melting which is then connected with Forming which is further connected with Sampling. Sampling is connected with Inspection and Testing which is then connected with Secondary Processing which is finally connected with Warehousing.\"}}"}
{"file_name": "Normal (174).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Cell in human body is connected with Flexible Assembly Cell which is then connected with Study cell particle. Study cell particle is connected with Multi-Functional Layer Bonding Cell which is finally connected with Slicing Cell.\"}}"}
{"file_name": "Normal (175).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"If Are you thirsty? is Yes then Take water and if Are you thirsty? is no then Don't get a drink.\"}}"}
{"file_name": "Normal (176).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"New Budget is connected with Make an edit which if Make an edit is Wait then Was the article edited further?. If Was the article edited further is Yes then Do you agree with the change? which if Do you agree with the change? is Disagree then Discuss which if Discuss is Implement then again Make an edit and If Do you agree with the change? is Agree then Implement Budget. Also, If Was the article edited further? is No then Implement Budget.\"}}"}
{"file_name": "Normal (177).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Input Source is connected with Input Transducers which is then connected with Modulation which is further connected with Source Encoder. Source Encoder is connected with Encoder which is then connected with Base-band Amplifier which is further connected with Channel. Channel is connected with Band-pass Demodulator which is then connected with Decoder which is further connected with Source Decoder. Source Decoder is connected with De-modulation which is then connected with Output Transducers which is finally connected with Output Signal.\"}}"}
{"file_name": "Normal (178).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Requirements which is then connected with System simulation. System simulation is connected with Result Analyzing which is then connected with Improvement & Development. Improvement & Development is connected with Hardware implementation which is then connected with Display which is finally connected with End.\"}}"}
{"file_name": "Normal (179).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Start is connected with Power On which is then connected with Look for previous data which is further connected with Generate Map and Location. Generate Map and Location is connected with Plan route which is then connected with both Route and Stop.\"}}"}
{"file_name": "Normal (180).png", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Privacy is connected with Password and Biometric Cryptosystem. Password is then connected with PIN and Non-invertible Transformation and Biometric Cryptosystem is connected with Key Binding and Key Generation.\"}}"}
